app/controllers/forms_controller.rb

  def show
    @form = Form.with_questions.find(params[:id])
---
SELECT `forms`.* FROM `forms` WHERE `forms`.`id` = 3 LIMIT 1