app/controllers/responses_controller.rb

  def create
    # if this is a submission from ODK collect
    if request.format == Mime::XML
      if %w(HEAD GET).include?(request.method)
        # just render the 'no content' status since that's what odk wants!
        render(:nothing => true, :status => 204)
      elsif upfile = params[:xml_submission_file]
        begin
          contents = upfile.read
          Response.create_from_xml(contents, current_user, current_mission)
---
INSERT INTO `responses` (`created_at`, `form_id`, `mission_id`, `reviewed`, `source`, `updated_at`, `user_id`) VALUES ('2013-02-23 22:33:46', 9, 1, 0, 'web', '2013-02-23 22:33:46', 3)