app/controllers/sms_responses_controller.rb

SELECT `users`.* FROM `users` WHERE (phone = '+243816107022' || phone2 = '+243816107022') ORDER BY users.name LIMIT 1
SELECT COUNT(*) FROM `users` WHERE (phone = '+243816107022' || phone2 = '+243816107022')
SELECT `settings`.* FROM `settings` WHERE `settings`.`mission_id` = 1 LIMIT 1
INSERT INTO `answers` (`created_at`, `date_value`, `datetime_value`, `option_id`, `questioning_id`, `response_id`, `time_value`, `updated_at`, `value`) VALUES ('2013-02-23 20:07:30', NULL, NULL, 1, 35, 83, NULL, '2013-02-23 20:07:30', NULL)
INSERT INTO `responses` (`created_at`, `form_id`, `mission_id`, `reviewed`, `source`, `updated_at`, `user_id`) VALUES ('2013-02-23 20:07:30', 7, 1, 0, 'sms', '2013-02-23 20:07:30', 3)
---
	def incoming
		@adapter = Sms::Adapters::Factory.new.create(params[:provider])
		smses = @adapter.receive(params) # return hash with phone number and message

		I18n.locale = params[:lng]

		smses.each do |sms|
				sender_info = User.where('phone = ? || phone2 = ?', sms[:phone], sms[:phone])
			unless sender_info.empty?
				unless sender_info.count > 1

					sender = sender_info.first

					if SmsResponse.message_loaded?(sms[:message])

						mission = SmsResponse.get_mission
						Setting.find_or_create(mission)

						if sender.can_access_mission?(mission)

							SmsResponse.save_answers(sender)