app/controllers/user_sessions_controller.rb

SELECT `users`.* FROM `users` WHERE (LOWER(`users`.login) = 'super') ORDER BY users.name LIMIT 1
---
  def create
    @captcha = false
    # if IP has not been logged yet, or this is the first attempt to login from the user..
    ip = request.env['REMOTE_ADDR'].to_s
    if (@user_ip = IpLogin.find_by_ip_address(ip)).nil?
      @user_ip = IpLogin.create(:ip_address => ip, :login_attempts => 0 )
    end

    @user_session = UserSession.new(params[:user_session])


    # if session attempts is nil (which means it hasn't been set) or is less than three..
    if  @user_ip.login_attempts < 3
      if @user_session.save
        reset_session

        # reset the perishable token for security's sake
        @user_session.user.reset_perishable_token!

        # destroy the row in user ip table once user logs in successfully
        @user_ip.destroy

        flash[:success] = "Login successful"
        redirect_back_or_default(root_path)
        return
      else
        flash[:error] = @user_session.errors.full_messages.join(",")

UPDATE `users` SET `login_count` = 28, `last_request_at` = '2013-02-17 12:16:21', `updated_at` = '2013-02-17 12:16:21' WHERE `users`.`id` = 1
---
        @user_ip.login_attempts = 0

        # if credentials are incorrect and captcha is valid
        if !@user_session.save